app/Controllers/Home.php

    public function index()
    {
        echo $this->request->getIPAddress();
        $mahasiswa = new Mahasiswa();
        $data['mhs'] = $mahasiswa->findAll();
---
SELECT *
FROM `mahasiswas`